{
  "resume_id": "abfc7e9a-cd14-4631-984c-c492f4718856",
  "filename": "Miguel Garcia Resume.pdf",
  "text": "Miguel Garcia\n+1 (862) 591-8163 | mag252@njit.edu | linkedin.com/in/miguelanggarcia | github.com/MiguelGarcia-SWE\nEducation\nNew Jersey Institute of Technology\nNewark, NJ\nB.S. in Computer Engineering, Minor in Computational Mathematics\nExpected May 2027\n• Relevant Coursework: Data Structures & Algorithms, Operating Systems, Machine Learning, Computer\nOrganization & Architecture, Linear Algebra, Differential Equations, Computer Graphics\n• Affiliations: SHPE, CodePath, EOP, ALPFA, ColorStack, HISPA Role Model\nExperience\nUndergraduate Researcher – Neural Fluid Simulation — NJIT — Newark, NJ\nOct 2025 – Present\n• Building PyTorch models to simulate fluid dynamics under faculty supervision.\n• Processing simulation datasets and comparing neural network outputs to physics-based benchmarks.\n• Documenting research progress through visualizations and technical reports.\nFull Stack Software Development Co-op — Verizon — Basking Ridge, NJ\nJan 2025 – Jun 2025\n• Engineered a modular multi-agent conversational system using layered NLP classification and domain-specific\nprompts, improving accuracy and enabling faster prototyping.\n• Architected and deployed a responsive React.js + Vite frontend with progressive rendering and multimodal\ninteraction, reducing load times and boosting engagement.\n• Built a scalable RESTful Node.js + Express backend with MongoDB, improving session reliability and query\nperformance.\n• Integrated Google Custom Search and ElevenLabs/Web Speech APIs to enhance multimodal experiences.\nGlobal Network & Technology Performance Intern — Verizon — Hempstead, NY Jun 2024 – Aug 2024\n• Automated Excel processes and internal data tools, improving accuracy and reducing manual workload.\n• Enhanced data validation workflows, reducing system errors and boosting reliability.\n• Developed workflows to update 1,350+ addresses and 2,000+ Build Drivers for 2024.\nProjects\nRay Tracing AI Tutor – Interactive Educational Platform\nReact, WebGPU, PyTorch\n• Developing a WebGPU ray tracing engine with real-time visualizations and interactive parameter controls.\n• Building a PyTorch LoRA fine-tuned model on 5,000+ ray tracing Q&A pairs for an educational AI assistant.\n• Integrating AI-powered tutoring with real-time visual demonstrations.\n3D Rube Goldberg Machine\nUnreal Engine 5, C++\n• Designing a physics-based interactive Rube Goldberg machine for a creative externship challenge.\n• Implemented 15+ mechanisms with Blueprint and C++, focusing on dynamic interactions and optimization.\nReal-Time Obstacle Avoidance System\nPython, Jetson Nano, Computer Vision\n• Built a real-time obstacle avoidance system with Jetson Nano and object classification models.\n• Designed a Pygame-based simulation with custom socket architecture for dynamic visualization.\n• Implemented adaptive path planning, improving success rates and reducing collisions.\nLeadership\nExternal VP Committee Officer — SHPE, NJIT Chapter — Newark, NJ\nSep 2024 – Dec 2024\n• Built corporate sponsor relationships, increasing funding and opportunities for chapter members.\n• Coordinated a Microsoft HOLA partnership to host professional development sessions.\nNJ Governor’s Fellow — CHPRD — Remote\nJun 2023 – Jul 2023\n• Led an 8-member team to develop HISPA’s political outreach strategy.\n• Delivered motivational talks to 300+ students in underserved communities as a HISPA role model.\nTechnical Skills\nProgramming & Scripting: Python, C/C++, JavaScript, TypeScript\nFrameworks & Libraries: React.js, Node.js, Express.js, PyTorch, Vite\nWeb & Systems: RESTful APIs, WebGPU, WebSockets, MongoDB, Git/GitHub\nGraphics & Simulation Development: Unreal Engine 5 (Blueprint + C++), Ray Tracing, Computer Vision, Pygame\nTools & Platforms: Docker, Linux, Jetson Nano, Salesforce, Excel, Web Speech APIs",
  "character_count": 3770,
  "header": "<p>Contact information not available</p>",
  "projects": "<p>No projects information available</p>",
  "skills": "<p>No skills information available</p>",
  "experience": "<p>No experience information available</p>",
  "education": "<p>No education information available</p>",
  "course_work": [],
  "created_at": "2025-10-07T02:14:14.556135",
  "updated_at": "2025-10-07T02:14:14.556135"
}